"""++====-----------==--------=-------+--- ------------   ------- -- ---   -
| Это класс уровней доступа. Тут можно добавить/изменить роли
|
|
\==---=-------------+------------- -------  ----   -   -"""


class Permission:
    levels = {'Нуб': 0,
              'Нубик': 0,
              'Креатив': 0,
              'Энигма': 0,
              'Админ': 1,
              'Хелпер': 1,
              'Спонсор': 1,
              'Хакер': 2,
              'Троль': 2,
              'Гл.Админ': 2,
              'Владелец': 3,
              'Гл.Про': 3,
              'Консоль': 4,
              'Модер': 5,
              'Санта': 5,
              'OP': 6,
              'Билдер': 6,
              'Администратор': 7,
              'Персонал': 8,
              '*': 9}

    admins = ['222261320']
